
// Возвращает выборку уникальных заказов в документе
Функция ВыбратьЗаказы(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Заказ КАК Заказ
	|ИЗ
	|	Документ.Выдача.Заказы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ВыдатьЗаказы(Знач КоллекцияЗаказов) Экспорт
	
	ДокументВыдачи = Документы.Выдача.СоздатьДокумент();
	ДокументВыдачи.УстановитьНовыйНомер();
	ДокументВыдачи.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Заказ Из КоллекцияЗаказов Цикл
		ДокументВыдачи.Заказы.Добавить().Заказ = Заказ;
	КонецЦикла;	
	
	Попытка
		ДокументВыдачи.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументВыдачи.Ссылка;
	
КонецФункции
	
