
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ЭтотОбъект.Движения.СтатусыЗаказа.Очистить();
	ЭтотОбъект.Движения.СтатусыЗаказа.Записывать = Истина;
	
	Выборка = Документы.Выдача.ВыбратьЗаказы(Ссылка);
	РегистрыСведений.ЗаказыКВыдаче.ЗаблокироватьЗаписи(Выборка.Владелец());
	Пока Выборка.Следующий() Цикл
		
		Запись = ЭтотОбъект.Движения.СтатусыЗаказа.Добавить();
		Запись.Период = Дата;
		Запись.Регистратор = Ссылка;
		Запись.Заказ = Выборка.Заказ;
		Запись.Статус = Перечисления.СтатусыЗаказа.Выдан;
		
		РегистрыСведений.ЗаказыКВыдаче.Удалить(Выборка.Заказ);
		
	КонецЦикла;
	
КонецПроцедуры

