
Функция ДанныеДляИнтеграции(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПланПоступления.Номер КАК Номер,
	|	ПланПоступления.Дата КАК Дата
	|ИЗ
	|	Документ.ПланПоступления КАК ПланПоступления
	|ГДЕ
	|	ПланПоступления.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("number", Выборка.Номер);
	Результат.Вставить("date", Выборка.Дата);
	Результат.Вставить("id", XMLСтрока(Ссылка));
	
	Возврат Результат;
	
КонецФункции