
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РегистрыСведений.ПланыПоступлений.Заблокировать(Ссылка);
	РегистрыСведений.ПланыПоступлений.Добавить(Ссылка);
	
	ЭтотОбъект.Движения.СтатусыЗаказа.Очистить();
	ЭтотОбъект.Движения.СтатусыЗаказа.Записывать = Истина;
	
	Выборка = Документы.ПланПоступления.ВыбратьЗаказы(Ссылка);
	Пока Выборка.Следующий() Цикл
		
		Запись = ЭтотОбъект.Движения.СтатусыЗаказа.Добавить();
		Запись.Период = Дата;
		Запись.Регистратор = Ссылка;
		Запись.Заказ = Выборка.Заказ;
		Запись.Статус = Перечисления.СтатусыЗаказа.ОжидаетсяПоступление;
		
	КонецЦикла;
	
КонецПроцедуры

