
Процедура Добавить(Знач Заказ) Экспорт
	
	Запись = РегистрыСведений.ЗаказыКВыдаче.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	Если Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Заказ = Заказ;
	Запись.Записать();
	
КонецПроцедуры

Процедура Удалить(Знач Заказ) Экспорт
	
	Запись = РегистрыСведений.ЗаказыКВыдаче.СоздатьМенеджерЗаписи();
	Запись.Заказ = Заказ;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	Запись.Удалить();
	
КонецПроцедуры

Процедура Заблокировать(Знач Заказ) Экспорт
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	Блокировка = БлокировкаДанных.Добавить("РегистрСведений.ЗаказыКВыдаче");
	Блокировка.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.УстановитьЗначение("Заказ", Заказ);
	
	БлокировкаДанных.Заблокировать();	
	
КонецПроцедуры

Процедура ЗаблокироватьЗаписи(Знач ИсточникДанных) Экспорт
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	Блокировка = БлокировкаДанных.Добавить("РегистрСведений.ЗаказыКВыдаче");
	Блокировка.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.ИсточникДанных = ИсточникДанных;
	Блокировка.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	
	БлокировкаДанных.Заблокировать();	
	
КонецПроцедуры