
Функция ПомеченНаУдаление() Экспорт
	
	Возврат Новый HTTPСервисОтвет(202, "Marked for Deletion");
	
КонецФункции

Функция РесурсНеНайден() Экспорт
	
	Возврат Новый HTTPСервисОтвет(404, "Not Found");
	
КонецФункции

Функция ОшибкаПриложения() Экспорт
	
	Возврат Новый HTTPСервисОтвет(500, "Internal Server Error");
	
КонецФункции

Функция ОбъектСоздан(Знач ДанныеОбъекта = Неопределено) Экспорт
	
	Результат = Новый HTTPСервисОтвет(201, "Created");
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектОбновлен() Экспорт
	
	Возврат Новый HTTPСервисОтвет(200, "OK");
	
КонецФункции