
#Область КодыОтветов

Функция ПомеченНаУдаление() Экспорт
	
	Возврат Новый HTTPСервисОтвет(202, "Marked for Deletion");
	
КонецФункции

Функция РесурсНеНайден() Экспорт
	
	Возврат Новый HTTPСервисОтвет(404, "Not Found");
	
КонецФункции

Функция ОшибкаПриложения() Экспорт
	
	Возврат Новый HTTPСервисОтвет(500, "Internal Server Error");
	
КонецФункции

Функция ОбъектСоздан(Знач ДанныеОбъекта = Неопределено) Экспорт
	
	Результат = Новый HTTPСервисОтвет(201, "Created");
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектОбновлен() Экспорт
	
	Возврат Новый HTTPСервисОтвет(200, "OK");
	
КонецФункции

Функция ГотовКВыдаче(Знач ДатаПриемки = Неопределено) Экспорт
	
	Если ТипЗнч(ДатаПриемки) <> Тип("Дата") Тогда 
		Возврат Новый HTTPСервисОтвет(200, "Ready");
	КонецЕсли;
	
	Результат = Новый HTTPСервисОтвет(200, "Ready", ЗаголовкиДанных());
		
	СтруктураОтвета = Новый Структура("date", ДатаПриемки);
	ТелоОтвета = ИнтеграцияJSON.Записать(СтруктураОтвета);
	Результат.УстановитьТелоИзСтроки(
		ТелоОтвета, 
		КодировкаТекста.UTF8,
		ИспользованиеByteOrderMark.НеИспользовать);
		
	Возврат Результат;
	
КонецФункции

Функция НеГотовКВыдаче() Экспорт
	
	Возврат Новый HTTPСервисОтвет(204, "Not Ready");
	
КонецФункции

#КонецОбласти

#Область Заголовки

Функция ЗаголовкиДанных()
	
	Результат = Новый Соответствие;
	Результат.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти