
// Возвращает выборку уникальных заказов в документе
Функция ВыбратьЗаказы(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеДокумента.Заказ КАК Заказ
	|ИЗ
	|	Документ.Приемка.Заказы КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПринятьЗаказы(Знач КоллекцияЗаказов) Экспорт
	
	ДокументПриемки = Документы.Приемка.СоздатьДокумент();
	ДокументПриемки.УстановитьНовыйНомер();
	ДокументПриемки.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Заказ Из КоллекцияЗаказов Цикл
		ДокументПриемки.Заказы.Добавить().Заказ = Заказ;
	КонецЦикла;	
	
	Попытка
		ДокументПриемки.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументПриемки.Ссылка;
	
КонецФункции
