

// HTTP POST /point/shipment_plan
// {
//	shipment_date: 2020-04-20,
//	agent_name: "Шерзод Галиев",
//	agent_phone: "+7 (500) 123-45-67",
//	agent_car: "X123YY77",
//	orders: {
//		id: "123--3423",
//		recipient: "Виктор Столяров",
//		phone: "+7 (500) 222-33-44"
//	}
// }
Функция ПланПоступленияДобавить(Запрос)
	
	Возврат Интеграция.ПланПоступленияДобавить(Запрос);
		
КонецФункции

Функция ВыдачаЗаказаГотов(Запрос)
	
	Возврат Интеграция.ВыдачаЗаказаГотов(Запрос);
	
КонецФункции

// HTTP DELETE /point/shipment_plan/{plan_code}
Функция ПланПоступленияОтменить(Запрос)
	
	Возврат Интеграция.ПланПоступленияОтменить(Запрос);
	
КонецФункции

// HTTP PUT /point/shipment_plan/{plan_code}
Функция ПланПоступленияОбновить(Запрос)
	
	Возврат Интеграция.ПланПоступленияОбновить(Запрос);
	
КонецФункции
