

// HTTP POST /point/shipment_plan
// {
//	shipment_date: 2020-04-20,
//	agent_name: "Шерзод Галиев",
//	agent_phone: "+7 (500) 123-45-67",
//	agent_car: "X123YY77",
//	orders: {
//		id: "123--3423",
//		recipient: "Виктор Столяров",
//		phone: "+7 (500) 222-33-44"
//	}
// }
Функция ПланПоступленияДобавить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПланПоступления = Документы.ПланПоступления.СоздатьДокумент();
	
	// TODO: Разбор, создание коробок, заполнение
	
	Попытка
		ПланПоступления.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ИнтеграцияHTTP.ОшибкаПриложения();
	КонецПопытки;
	
	ДанныеОтвета = Документы.ПланПоступления.ДанныеДляИнтеграции(ПланПоступления.Ссылка);
	ТелоОтвета = ИнтеграцияJSON.Записать(ДанныеОтвета);
	Возврат ИнтеграцияHTTP.ОбъектСоздан(ТелоОтвета);
		
КонецФункции

Функция ВыдачаЗаказаГотов(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

// HTTP DELETE /point/shipment_plan/{plan_code}
Функция ПланПоступленияОтменить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерПлана = Запрос.ПараметрыURL.Получить("plan_code");
	
	ПланПоступления = Документы.ПланПоступления.НайтиПоНомеру(НомерПлана);
	Если Не ЗначениеЗаполнено(ПланПоступления) Тогда
		Возврат ИнтеграцияHTTP.РесурсНеНайден();
	КонецЕсли;
	
	Попытка	
		ПланПоступления
			.ПолучитьОбъект()
			.УстановитьПометкуУдаления(Истина);
	Исключение
		Возврат ИнтеграцияHTTP.ОшибкаПриложения();
	КонецПопытки;
	
	Возврат ИнтеграцияHTTP.ПомеченНаУдаление();
	
КонецФункции

// HTTP PUT /point/shipment_plan/{plan_code}
Функция ПланПоступленияОбновить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НомерПлана = Запрос.ПараметрыURL.Получить("plan_code");
	
	ПланПоступления = Документы.ПланПоступления.НайтиПоНомеру(НомерПлана);
	Если Не ЗначениеЗаполнено(ПланПоступления) Тогда
		Возврат ИнтеграцияHTTP.РесурсНеНайден();
	КонецЕсли;
	
	// TODO: Разбор, очистка, создание коробок, заполнение
	
	Попытка	
		ПланПоступления
			.ПолучитьОбъект()
			.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат ИнтеграцияHTTP.ОшибкаПриложения();
	КонецПопытки;
	
	Возврат ИнтеграцияHTTP.ОбъектОбновлен();
	
КонецФункции
