
Функция Зарегистрировать(Знач Заказ) Экспорт
	
	Если ТипЗнч(Заказ) <> Тип("СправочникСсылка.Заказ") Или
		Не ЗначениеЗаполнено(Заказ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОплаты = Документы.ОплатаЗаказа.СоздатьДокумент();
	ДокументОплаты.УстановитьНовыйНомер();
	ДокументОплаты.Дата = ТекущаяДатаСеанса();
	ДокументОплаты.Заказ = Заказ;
	
	Попытка
		ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ДокументОплаты.Ссылка;
	
КонецФункции

