
// Заказ готов к выдаче, если его последний статус - Принят
//
// Параметры:
//	Заказ - СправочникСсылка.Заказ - проверяемый заказ
//
// Возвращаемое значение:
//	- Булево - Истина, если заказ готов к выдаче
Функция ЗаказГотовКВыдаче(Знач Заказ) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Результат
	|ИЗ
	|	РегистрСведений.СтатусыЗаказа.СрезПоследних(, Заказ = Заказ) КАК СтатусыЗаказаСрезПоследних
	|ГДЕ
	|	СтатусыЗаказаСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказа.Принят)");
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции // ЗаказГотовКВыдаче()
