
&НаСервереБезКонтекста
Функция ВыдатьЗаказы(Знач МассивЗаказов)
	
	Ссылка = Документы.Выдача.ВыдатьЗаказы(МассивЗаказов);
	
	Возврат ЗначениеЗаполнено(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура Выдать(Команда)
	
	ПриемкаУспешна = ВыдатьЗаказы(ВыбранныеЗаказы.ВыгрузитьЗначения());
	
	Если ПриемкаУспешна Тогда
		ВыбранныеЗаказы.Очистить();
		УстановитьЗаголовокКнопкиВыдать();
		Элементы.ЗаказыКВыдаче.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокКнопкиВыдать()
	
	Результат = "Выдать";
	Если ВыбранныеЗаказы.Количество() <> 0 Тогда
		Результат = СтрШаблон("Выдать [%1]", Формат(ВыбранныеЗаказы.Количество(), "ЧГ="));
	КонецЕсли;
	
	Элементы.ФормаВыдать.Заголовок = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокКнопкиВыдать();
	
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗаказыКВыдаче.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЗаказыКВыдаче.ЗаказВыбран");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Шрифт = Элементы.ЗаказыКВыдаче.Шрифт;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Шрифт,,,Истина));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформлениеФормы();
	
	ЗаказыКВыдаче.Параметры.УстановитьЗначениеПараметра("ВыбранныеЗаказы", ВыбранныеЗаказы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыКВыдачеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элементы.ЗаказыКВыдаче.ДанныеСтроки(ВыбраннаяСтрока);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныйЭлемент = ВыбранныеЗаказы.НайтиПоЗначению(ДанныеСтроки.Заказ);
	Если НайденныйЭлемент = Неопределено Тогда
		ВыбранныеЗаказы.Добавить(ДанныеСтроки.Заказ);
	Иначе
		ВыбранныеЗаказы.Удалить(НайденныйЭлемент);
	КонецЕсли;	
	
	ЗаказыКВыдаче.Параметры.УстановитьЗначениеПараметра("ВыбранныеЗаказы", ВыбранныеЗаказы.ВыгрузитьЗначения());
	
	УстановитьЗаголовокКнопкиВыдать();	

КонецПроцедуры
